<a href="https://colab.research.google.com/github/insanudin16/Latihan-Data-Analysis-Data-Science/blob/main/tips___tricks.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Menyertakan Prefix dan Suffix pada Seluruh Kolom Pandas DataFrame

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.1
1.21.3

#### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = ['A','B','C','D','E']
# cols = ("ABCDE")

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)

df

   A  B  C  D  E
0  4  5  6  8  8
1  4  9  1  4  6
2  4  3  4  8  6
3  8  4  1  6  8
4  7  2  1  6  9

#### Menambahkan Prefix pada Nama Kolom

In [ ]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        5        6        8        8
1        4        9        1        4        6
2        4        3        4        8        6
3        8        4        1        6        8
4        7        2        1        6        9

#### Menambahkan Suffix pada Nama Kolom

In [ ]:
df.add_suffix('_kolom')

   A_kolom  B_kolom  C_kolom  D_kolom  E_kolom
0        4        5        6        8        8
1        4        9        1        4        6
2        4        3        4        8        6
3        8        4        1        6        8
4        7        2        1        6        9

## Pemilihan baris (rows selection) pada Data Frame

#### Persiapan Data Frame

In [ ]:
n_rows = 10
n_cols = 5
cols = ['A','B','C','D','E']
# cols = ('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  7  7  2  6
1  1  5  2  6  8
2  2  5  7  3  5
3  8  3  9  2  6
4  4  1  1  7  1
5  8  1  9  7  8
6  8  2  3  4  6
7  4  3  5  2  9
8  6  7  7  7  3
9  3  9  3  4  4

#### Selection dengan operator logika `|`

In [ ]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  7  7  2  6
1  1  5  2  6  8
9  3  9  3  4  4

#### Selection dengan fungsi `isin()`

In [ ]:
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  3  7  7  2  6
1  1  5  2  6  8
9  3  9  3  4  4

#### Selection dengan fungsi negasi ~

In [ ]:
df[~df['A'].isin([1,3])]

   A  B  C  D  E
2  2  5  7  3  5
3  8  3  9  2  6
4  4  1  1  7  1
5  8  1  9  7  8
6  8  2  3  4  6
7  4  3  5  2  9
8  6  7  7  7  3

## Konversi Tipe Data String ke Numerik pada Kolom Data Frame

#### Persiapan Data Frame

In [ ]:
data = {'kolom1': ['1','2','3','4','5'],
        'kolom2' : ['6','7','string','9','10']}

df = pd.DataFrame(data)
df

  kolom1  kolom2
0      1       6
1      2       7
2      3  string
3      4       9
4      5      10

#### Mengecek tipe data masing-masing kolom

In [ ]:
df.dtypes

kolom1    object
kolom2    object
dtype: object

#### Konversi tipe data dengan fungsi `astype()`

In [ ]:
# new_df = df.astype({'kolom1' : 'int'})
new_df = df.astype({'kolom1' : 'int'})
new_df

   kolom1  kolom2
0       1       6
1       2       7
2       3  string
3       4       9
4       5      10

In [ ]:
new_df.dtypes

kolom1    float64
kolom2     object
dtype: object

Note : Kita tidak bisa mengkonversi kolom2 ke tipe numerik karena ada kata 'string'.

#### Konversi tipe data numerik dengan fungsi `to_numerc()`

In [ ]:
df.apply(pd.to_numeric, errors="coerce")
# Argumen 'coerce' pada parameter 'errors' akan mengembalikan NaN jika ada sel yang isinya tidak bisa diubah ke tipe numerik

   kolom1  kolom2
0       1     6.0
1       2     7.0
2       3     NaN
3       4     9.0
4       5    10.0

## Pemilihan Kolom (Columns Selection) pada Data Frame Berdasarkan Tipe Data

#### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 2
cols = ['Float','Integer']

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)

df['Float'] = df['Float'].astype('float')

df['String'] = list('ABCDE')
df

   Float  Integer String
0    9.0        5      A
1    2.0        6      B
2    1.0        3      C
3    2.0        2      D
4    2.0        3      E

In [ ]:
df.dtypes

Float      float64
Integer      int32
String      object
dtype: object

#### Memilih kolom yang bertipe data number, int, dan float

In [ ]:
df.select_dtypes(include="number")

   Float  Integer
0    9.0        5
1    2.0        6
2    1.0        3
3    2.0        2
4    2.0        3

In [ ]:
df.select_dtypes(include="int")

   Integer
0        5
1        6
2        3
3        2
4        3

In [ ]:
df.select_dtypes(include="float")

   Float
0    9.0
1    2.0
2    1.0
3    2.0
4    2.0

#### Memilih kolom bertipe data string (object)

In [ ]:
df.select_dtypes(include="object")

  String
0      A
1      B
2      C
3      D
4      E

#### Memilih kolom dengan beberapa tipe data

In [ ]:
df.select_dtypes(include=["float","object"])

   Float String
0    9.0      A
1    2.0      B
2    1.0      C
3    2.0      D
4    2.0      E

## Membalik Urutan Baris dan Kolom pada Data Frame

#### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = ['A','B','C','D','E']

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  5  3  5  8
1  4  2  4  8  6
2  3  8  1  6  5
3  6  8  2  2  3
4  7  7  9  4  7

#### Membalik urutan kolom

In [ ]:
df.loc[:, ::-1]

   E  D  C  B  A
0  8  5  3  5  7
1  6  8  4  2  4
2  5  6  1  8  3
3  3  2  2  8  6
4  7  4  9  7  7

#### Membalik urutan baris

In [ ]:
df.loc[::-1,::-1]

   E  D  C  B  A
4  7  4  9  7  7
3  3  2  2  8  6
2  5  6  1  8  3
1  6  8  4  2  4
0  8  5  3  5  7

#### Membalik urutan baris dan melakukan penyesuaian ulang indeks

In [ ]:
df.loc[::-1].reset_index(drop=True) # Indeks lama dihapus

   A  B  C  D  E
0  7  7  9  4  7
1  6  8  2  2  3
2  3  8  1  6  5
3  4  2  4  8  6
4  7  5  3  5  8

## Mengganti Nama Kolom pada Data Frame

#### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = ['A','B','C','D','E']

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  8  3  2  1  1
1  7  5  7  9  4
2  4  7  7  2  4
3  8  8  8  5  6
4  2  3  1  7  7

#### Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [ ]:
df.rename(columns={'C':'X'})

   A  B  X  D  E
0  8  3  2  1  1
1  7  5  7  9  4
2  4  7  7  2  4
3  8  8  8  5  6
4  2  3  1  7  7

#### Mengganti nama (label) untuk banyak kolom pada Data Frame

In [ ]:
df.rename(columns={'A':'X', 'C':'Y', 'E':'Z'})

   X  B  Y  D  Z
0  8  3  2  1  1
1  7  5  7  9  4
2  4  7  7  2  4
3  8  8  8  5  6
4  2  3  1  7  7

## Menghapus Missing Values pada Data Frame

In [ ]:
df = pd.read_csv("dirtydata.csv")
df

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
18        45  '2020/12/18'     90       112       NaN
19        60  '2020/12/19'    103       123     323.0
20        45  '2020/12/20'     97       125     243.0
21        60  '2020/12/21'    108       131     364.2
22        45           NaN    100       119     282.0
23        60  '2020/12/23'    130       101     300.0
24        45  '2020/12/24'    105       132     246.0
25        60  '2020/12/25'    102       126     334.5
26        60      20201226    100       120     250.0
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

#### Menghapus setiap kolom yang mengandung missing values

In [ ]:
df.dropna(axis='columns')

    Duration  Pulse  Maxpulse
0         60    110       130
1         60    117       145
2         60    103       135
3         45    109       175
4         45    117       148
5         60    102       127
6         60    110       136
7        450    104       134
8         30    109       133
9         60     98       124
10        60    103       147
11        60    100       120
12        60    100       120
13        60    106       128
14        60    104       132
15        60     98       123
16        60     98       120
17        60    100       120
18        45     90       112
19        60    103       123
20        45     97       125
21        60    108       131
22        45    100       119
23        60    130       101
24        45    105       132
25        60    102       126
26        60    100       120
27        60     92       118
28        60    103       132
29        60    100       132
30        60    102       129
31        60     92       115

#### Menghapus setiap baris yang mengandung missing values

In [ ]:
df.dropna(axis="rows")

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
19        60  '2020/12/19'    103       123     323.0
20        45  '2020/12/20'     97       125     243.0
21        60  '2020/12/21'    108       131     364.2
23        60  '2020/12/23'    130       101     300.0
24        45  '2020/12/24'    105       132     246.0
25        60  '2020/12/25'    102       126     334.5
26        60      20201226    100       120     250.0
27        60  '2020/12/27'     92       118     241.0
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

#### Menampilkan presentase missing values untuk tiap kolom

In [ ]:
df.isna().mean()

Duration    0.00000
Date        0.03125
Pulse       0.00000
Maxpulse    0.00000
Calories    0.06250
dtype: float64

#### Menghapus setiap kolom yang mengandung missing values berdasarkan threshold

In [ ]:
threshold = len(df) * 0.995
df.dropna(thresh=threshold, axis='columns')

    Duration  Pulse  Maxpulse
0         60    110       130
1         60    117       145
2         60    103       135
3         45    109       175
4         45    117       148
5         60    102       127
6         60    110       136
7        450    104       134
8         30    109       133
9         60     98       124
10        60    103       147
11        60    100       120
12        60    100       120
13        60    106       128
14        60    104       132
15        60     98       123
16        60     98       120
17        60    100       120
18        45     90       112
19        60    103       123
20        45     97       125
21        60    108       131
22        45    100       119
23        60    130       101
24        45    105       132
25        60    102       126
26        60    100       120
27        60     92       118
28        60    103       132
29        60    100       132
30        60    102       129
31        60     92       115

## Memeriksa Kesamaan antara Dua Buah Kolom (Series) pada Data Frame

In [ ]:
data = {'Kolom1' : [1,2,3,4,np.NaN],
        'Kolom2' : [1,2,3,4,np.NaN]}

df = pd.DataFrame(data)
df

   Kolom1  Kolom2
0     1.0     1.0
1     2.0     2.0
2     3.0     3.0
3     4.0     4.0
4     NaN     NaN

#### Memeriksa kesamaan dengan operator `==`

In [ ]:
df['Kolom1'] == df['Kolom2']

0     True
1     True
2     True
3     True
4    False
dtype: bool

#### Memeriksa kesamaan dengan method `equals()`

In [ ]:
df['Kolom2'].equals(df['Kolom1'])

True

## Memeriksa Kesamaan antara Dua Data Frame

In [ ]:
new_df = df.copy(deep=True)
new_df

   Kolom1  Kolom2
0     1.0     1.0
1     2.0     2.0
2     3.0     3.0
3     4.0     4.0
4     NaN     NaN

In [ ]:
df == new_df

   Kolom1  Kolom2
0    True    True
1    True    True
2    True    True
3    True    True
4   False   False

In [ ]:
new_df.equals(df)

True

## Membagi Data Frame Menjadi Dua Secara Acak

#### Persiapan data frame

In [ ]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  4  6  3  4
1  5  3  2  2  4
2  8  2  7  7  4
3  2  8  9  7  3
4  8  1  7  7  5
5  8  2  5  6  8
6  3  3  5  9  6
7  3  8  6  9  4
8  4  9  3  8  6
9  2  7  3  8  4

#### Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [ ]:
df.shape

(10, 5)

In [ ]:
proporsi = 0.7
df1 = df.sample(frac=proporsi)
df2 = df.drop(df1.index)

print(df1, '\n')
print(df2)

   A  B  C  D  E
3  2  8  9  7  3
6  3  3  5  9  6
5  8  2  5  6  8
0  4  4  6  3  4
7  3  8  6  9  4
2  8  2  7  7  4
8  4  9  3  8  6

   A  B  C  D  E
1  5  3  2  2  4
4  8  1  7  7  5
9  2  7  3  8  4

## Mengganti Nama (Label) Kolom pada Data Frame Berdasarkan Pola Tertentu

In [ ]:
df = pd.read_csv("data2.csv")
df.columns = ['No',' duration','Pulse','Max pulse', 'calories ']

df.columns

Index(['No', ' duration', 'Pulse', 'Max pulse', 'calories '], dtype='object')

#### Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan `_`

In [ ]:
df.columns = df.columns.str.replace(' ','_').str.lower()
df

   no  _duration  pulse  max_pulse  calories_
0   1         60    110        130      409.1
1   2         60    117        145      479.0
2   3         60    103        135      340.0
3   4         45    109        175      282.4
4   5         45    117        148      406.0
5   6         60    102        127      300.0
6   7         60    110        136      374.0
7   8         45    104        134      253.3
8   9         30    109        133      195.1
9  10         60     98        124      269.0

#### Memangkas kelebihan spasi pada nama kolom dan mengganti spasi dengan `_`

In [ ]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ','_')
df

   no  duration  pulse  max_pulse  calories
0   1        60    110        130     409.1
1   2        60    117        145     479.0
2   3        60    103        135     340.0
3   4        45    109        175     282.4
4   5        45    117        148     406.0
5   6        60    102        127     300.0
6   7        60    110        136     374.0
7   8        45    104        134     253.3
8   9        30    109        133     195.1
9  10        60     98        124     269.0